"""Постоянные константы"""

CHARACTER_LENGTH = 150
MAXIMUM_LENGTH = 200
LENGTH_FOR_MAIL = 254
LENGTH_FOR_COLOR = 7
MINCOUNT = 1
MAXIMUMCOUNT = 1000
DEFAULTCOLOR = '#ffd057'
FILE_NAME = 'shopping_cart.txt'
DIRICTORYPATH = 'recipe_img/'
MAXIMUMTIME = 360
FAVORITERECIPE = 'У вас уже есть это рецепт'
SHOPINGLIST = 'Уже добавленно в карзину. Пора за покупочками'
IMAGENOT = 'Поле image не может быть пустым.'
NOTAVTORIZATION = 'Вы не авторизованы. Доступ запрещен.'
NAMEERROR = 'Тег с таким названием уже существует.'
COLORERROR = 'Такой цвет уже существует.'
SLUGERROR = 'Такой Slug уже существует.'
USERNAMEERROR = 'Пользователь с таким username уже существует.'
EMAILERROR = 'e-mail уже занят.'
NAMEINGRERROR = 'Такой ингредиент уже есть.'
COOKETAMEMIN = 'Время приготовления не может быть меньше 1'
COOKETAMEMAX = 'Время приготовления не может быть больше 360'
AMOUNTMIN = 'Количество ингредиента не может быть нулевым'
AMOUNTMAX = 'Количество ингредиента не может быть больше тысячи'


INGREDIENT_UNITS = (
    ('г', 'граммы'),
    ('стакан', 'стакан'),
    ('по вкусу', 'по вкусу'),
    ('ст. л.', 'столовая ложка'),
    ('шт.', 'штука'),
    ('мл', 'миллилитры'),
    ('кг', 'килограммы'),
    ('л', 'литры'),
    ('ч. л.', 'чайная ложка'),
    ('банка', 'банка'),
    ('пакетик', 'пакетик'),
    ('пучок', 'пучок'),
    ('лист', 'лист'),
    ('зубчик', 'зубчик'),
    ('бутылка', 'бутылка'),
    ('пакет', 'пакет'),
    ('головка', 'головка'),
    ('корень', 'корень'),
    ('брусок', 'брусок'),
    ('кусочек', 'кусочек'),
    ('щепотка', 'щепотка'),
    ('брусочек', 'брусочек'),
    ('долька', 'долька'),
    ('чашка', 'чашка'),
    ('стебель', 'стебель'),
    ('пластинка', 'пластинка'),
    ('крошка', 'крошка'),
    ('кисточка', 'кисточка'),
)
