"""Постоянные константы"""

CHARACTER_LENGTH = 150
MAXIMUM_LENGTH = 200
LENGTH_FOR_MAIL = 254
LENGTH_FOR_COLOR = 7
MINCOUNT = 1
FILE_NAME = 'shopping_cart.txt'

INGREDIENT_UNITS = (
    ('г', 'граммы'),
    ('стакан', 'стакан'),
    ('по вкусу', 'по вкусу'),
    ('ст. л.', 'столовая ложка'),
    ('шт.', 'штука'),
    ('мл', 'миллилитры'),
    ('кг', 'килограммы'),
    ('л', 'литры'),
    ('ч. л.', 'чайная ложка'),
    ('банка', 'банка'),
    ('пакетик', 'пакетик'),
    ('пучок', 'пучок'),
    ('лист', 'лист'),
    ('зубчик', 'зубчик'),
    ('бутылка', 'бутылка'),
    ('пакет', 'пакет'),
    ('головка', 'головка'),
    ('корень', 'корень'),
    ('брусок', 'брусок'),
    ('кусочек', 'кусочек'),
    ('щепотка', 'щепотка'),
    ('брусочек', 'брусочек'),
    ('долька', 'долька'),
    ('чашка', 'чашка'),
    ('стебель', 'стебель'),
    ('пластинка', 'пластинка'),
    ('крошка', 'крошка'),
    ('кисточка', 'кисточка'),
)
