"""Постоянные константы"""

CHARACTER_LENGTH = 150
MAXIMUM_LENGTH = 200
LENGTH_FOR_MAIL = 254
LENGTH_FOR_COLOR = 7
MIN_COUNT = 1
MAXIMUM_COUNT = 1000
DEFAULT_COLOR = '#ffd057'
FILE_NAME = 'shopping_cart.txt'
DIRICTORY_PATH = 'recipe_img/'
MAXIMUMTIME = 360
FAVORITE_RECIPE = 'У вас уже есть это рецепт'
SHOPING_LIST = 'Уже добавленно в карзину. Пора за покупочками'
IMAGE_IS_NOT = 'Поле image не может быть пустым.'
NAME_ERROR = 'Тег с таким названием уже существует.'
COLOR_ERROR = 'Такой цвет уже существует.'
SLUG_ERROR = 'Такой Slug уже существует.'
USERNAME_ERROR = 'Пользователь с таким username уже существует.'
EMAIL_ERROR = 'e-mail уже занят.'
NAME_INGRIDENT_RERROR = 'Такой ингредиент уже есть.'
COOKE_TAME_MIN = 'Время приготовления не может быть меньше 1'
COOKE_TAME_MAX = 'Время приготовления не может быть больше 360'
AMOUNT_MIN = 'Количество ингредиента не может быть нулевым'
AMOUNT_MAX = 'Количество ингредиента не может быть больше тысячи'
NONE_INGREDIENTS = 'Необходимо указать ингредиенты'
NONE_TEGS = 'Необходимо указать теги'
IDENTICAL_INGREDIENTS = 'Ингредиенты не должны повторяться'
IDENTICAL_TAGS = 'Теги не должны повторяться'

INGREDIENT_UNITS = (
    ('г', 'граммы'),
    ('стакан', 'стакан'),
    ('по вкусу', 'по вкусу'),
    ('ст. л.', 'столовая ложка'),
    ('шт.', 'штука'),
    ('мл', 'миллилитры'),
    ('кг', 'килограммы'),
    ('л', 'литры'),
    ('ч. л.', 'чайная ложка'),
    ('банка', 'банка'),
    ('пакетик', 'пакетик'),
    ('пучок', 'пучок'),
    ('лист', 'лист'),
    ('зубчик', 'зубчик'),
    ('бутылка', 'бутылка'),
    ('пакет', 'пакет'),
    ('головка', 'головка'),
    ('корень', 'корень'),
    ('брусок', 'брусок'),
    ('кусочек', 'кусочек'),
    ('щепотка', 'щепотка'),
    ('брусочек', 'брусочек'),
    ('долька', 'долька'),
    ('чашка', 'чашка'),
    ('стебель', 'стебель'),
    ('пластинка', 'пластинка'),
    ('крошка', 'крошка'),
    ('кисточка', 'кисточка'),
)
